---
kind: property
id: P:Autodesk.Revit.DB.Viewport.LabelLineLength
source: html/1b9cdb90-85ba-424a-3df0-33cab7d066f6.htm
---
# Autodesk.Revit.DB.Viewport.LabelLineLength Property

The length of the viewport label line in sheet space, measured in feet.

## Syntax (C#)
```csharp
public double LabelLineLength { get; set; }
```

## Remarks
It can be negative. The sign depends on the direction of the label line.